/* Masstree
 * Eddie Kohler, Yandong Mao, Robert Morris
 * Copyright (c) 2012-2013 President and Fellows of Harvard College
 * Copyright (c) 2012-2013 Massachusetts Institute of Technology
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, subject to the conditions
 * listed in the Masstree LICENSE file. These conditions include: you must
 * preserve this copyright notice, and you cannot mention the copyright
 * holders in advertising related to the Software without their permission.
 * The Software is provided WITHOUT ANY WARRANTY, EXPRESS OR IMPLIED. This
 * notice is a summary of the Masstree LICENSE file; the license in that file
 * is legally binding.
 */
#ifndef STRING_BASE_HH
#define STRING_BASE_HH
#include "compiler.hh"
#include "hashcode.hh"
#include <assert.h>
#include <string.h>
#include <limits.h>
#include <ctype.h>
#include <iostream>

//  TODO: not sure these should go here but fine for now
template<typename T, typename U>
int atomic_memcmp(const T* ptr1, const U* ptr2, size_t num) {
    static_assert(sizeof(T) == 1, "T not one byte");
    static_assert(sizeof(U) == 1, "U not one byte");
    static_assert((std::is_same_v<T, relaxed_atomic<char>> ||
                   std::is_same_v<U, relaxed_atomic<char>>));
    
    // debug_fprintf(stdout, "atomic_memcmp()\n");
    for (unsigned i = 0; i < num; ++i) {
        unsigned char ca = static_cast<unsigned char>(ptr1[i]);
        unsigned char cb = static_cast<unsigned char>(ptr2[i]);
        if (ptr1[i] != ptr2[i])
            return ca - cb;
    }
    return 0;
}

template<typename T, typename U>
int maybe_atomic_memcmp(const T* ptr1, const U* ptr2, size_t num) {
    static_assert(sizeof(T) == 1, "T not one byte");
    static_assert(sizeof(U) == 1, "U not one byte");

    if constexpr ((std::is_same_v<T, relaxed_atomic<char>> ||
                   std::is_same_v<U, relaxed_atomic<char>>)) {
        return atomic_memcmp(ptr1, ptr2, num);
    }
    else
        return memcmp(ptr1, ptr2, num);
}

template<typename T, typename U>
void *atomic_memcpy(T *dest, const U* src, size_t count) {
    static_assert((std::is_same_v<T, relaxed_atomic<char>> ||
                   std::is_same_v<U, relaxed_atomic<char>>));
    // debug_fprintf(stdout, "atomic_memcpy()\n");
    for (unsigned i = 0; i < count; ++i) {
        dest[i] = src[i];
    }
    return dest;
}

template<typename T, typename U>
void *maybe_atomic_memcpy(T *dest, const U* src, size_t count) {
    static_assert(sizeof(T) == 1, "T not one byte");
    static_assert(sizeof(U) == 1, "U not one byte");
    
    if constexpr ((std::is_same_v<T, relaxed_atomic<char>> ||
                   std::is_same_v<U, relaxed_atomic<char>>)) {
        return atomic_memcpy(dest, src, count);
    }
    else
        return memcpy(dest, src, count);
}





namespace lcdf {

template <typename T>
struct make_unsigned_like {
    using type = std::make_unsigned_t<T>;
};

// Specialization for std::atomic<T>
template <typename T>
struct make_unsigned_like<relaxed_atomic<T>> {
    using type = relaxed_atomic<std::make_unsigned_t<T>>;
};

template <typename T>
using make_unsigned_like_t = typename make_unsigned_like<T>::type;




class StringAccum;
#define LCDF_CONSTANT_CSTR(cstr) ((cstr) && __builtin_constant_p(strlen((cstr))))
class String_generic_templated_common {
  public:
    static const char empty_data[1];
    static const char bool_data[11]; // "false\0true\0"
    static const char out_of_memory_data[15];
    static const char base64_encoding_table[65];
